For PC1:
Packet Tracer PC Command Line 1.0
C:\>ping 192.168.3.0

Pinging 192.168.3.0 with 32 bytes of data:

Reply from 192.168.2.2: bytes=32 time=2ms TTL=254
Reply from 192.168.2.2: bytes=32 time=1ms TTL=254
Reply from 192.168.2.2: bytes=32 time=1ms TTL=254
Reply from 192.168.2.2: bytes=32 time=1ms TTL=254

Ping statistics for 192.168.3.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 1ms, Maximum = 2ms, Average = 1ms

C:\>ping 192.168.5.0

Pinging 192.168.5.0 with 32 bytes of data:

Reply from 192.168.4.1: bytes=32 time=2ms TTL=253
Reply from 192.168.4.1: bytes=32 time=2ms TTL=253
Reply from 192.168.4.1: bytes=32 time=2ms TTL=253
Reply from 192.168.4.1: bytes=32 time=2ms TTL=253

Ping statistics for 192.168.5.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 2ms, Maximum = 2ms, Average = 2ms

C:\>ping 64.100.0.10

Pinging 64.100.0.10 with 32 bytes of data:

Request timed out.
Reply from 64.100.0.10: bytes=32 time=4ms TTL=126
Reply from 64.100.0.10: bytes=32 time=1ms TTL=126
Reply from 64.100.0.10: bytes=32 time=1ms TTL=126

Ping statistics for 64.100.0.10:
Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
Approximate round trip times in milli-seconds:
Minimum = 1ms, Maximum = 4ms, Average = 2ms

C:\>ping 64.100.0.10

Pinging 64.100.0.10 with 32 bytes of data:

Reply from 64.100.0.10: bytes=32 time=22ms TTL=126
Reply from 64.100.0.10: bytes=32 time=1ms TTL=126
Reply from 64.100.0.10: bytes=32 time=21ms TTL=126
Reply from 64.100.0.10: bytes=32 time=2ms TTL=126

Ping statistics for 64.100.0.10:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 1ms, Maximum = 22ms, Average = 11ms

C:\>

PC2
Packet Tracer PC Command Line 1.0
C:\>ping 192.168.1.0

Pinging 192.168.1.0 with 32 bytes of data:

Reply from 192.168.2.1: bytes=32 time=1ms TTL=254
Reply from 192.168.2.1: bytes=32 time=1ms TTL=254
Reply from 192.168.2.1: bytes=32 time=1ms TTL=254
Reply from 192.168.2.1: bytes=32 time=1ms TTL=254

Ping statistics for 192.168.1.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 1ms, Maximum = 1ms, Average = 1ms

C:\>ping 64.100.0.0

Pinging 64.100.0.0 with 32 bytes of data:

Reply from 209.165.200.226: bytes=32 time=24ms TTL=253
Reply from 209.165.200.226: bytes=32 time=2ms TTL=253
Reply from 209.165.200.226: bytes=32 time=2ms TTL=253
Reply from 209.165.200.226: bytes=32 time=2ms TTL=253

Ping statistics for 64.100.0.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 2ms, Maximum = 24ms, Average = 7ms

C:\>ping 192.168.5.0

Pinging 192.168.5.0 with 32 bytes of data:

Reply from 192.168.4.1: bytes=32 time=1ms TTL=254
Reply from 192.168.4.1: bytes=32 time=1ms TTL=254
Reply from 192.168.4.1: bytes=32 time=1ms TTL=254
Reply from 192.168.4.1: bytes=32 time=7ms TTL=254

Ping statistics for 192.168.5.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 1ms, Maximum = 7ms, Average = 2ms

C:\>

PC3

Packet Tracer PC Command Line 1.0
C:\>ping 64.100.0.10

Pinging 64.100.0.10 with 32 bytes of data:

Reply from 64.100.0.10: bytes=32 time=3ms TTL=124
Reply from 64.100.0.10: bytes=32 time=3ms TTL=124
Reply from 64.100.0.10: bytes=32 time=10ms TTL=124
Reply from 64.100.0.10: bytes=32 time=3ms TTL=124

Ping statistics for 64.100.0.10:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 3ms, Maximum = 10ms, Average = 4ms

C:\>ping 192.168.3.0

Pinging 192.168.3.0 with 32 bytes of data:

Reply from 192.168.4.2: bytes=32 time=8ms TTL=254
Reply from 192.168.4.2: bytes=32 time=1ms TTL=254
Reply from 192.168.4.2: bytes=32 time=1ms TTL=254
Reply from 192.168.4.2: bytes=32 time=2ms TTL=254

Ping statistics for 192.168.3.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 1ms, Maximum = 8ms, Average = 3ms

C:\>ping 192.168.1.0

Pinging 192.168.1.0 with 32 bytes of data:

Reply from 192.168.2.1: bytes=32 time=2ms TTL=253
Reply from 192.168.2.1: bytes=32 time=2ms TTL=253
Reply from 192.168.2.1: bytes=32 time=2ms TTL=253
Reply from 192.168.2.1: bytes=32 time=2ms TTL=253

Ping statistics for 192.168.1.0:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 2ms, Maximum = 2ms, Average = 2ms

R1
R1>
R1>en
R1#cof t
^
% Invalid input detected at '^' marker.
R1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R1(config)#ip route 0.0.0.0 0.0.0.0 S0/0/1
R1(config)#router
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto
R1(config-router)#no auto-summary 
R1(config-router)#network 192.168.1.0
R1(config-router)#network 192.168.2.0
R1(config-router)#passive-interface g0/0
R1(config-router)#default
R1(config-router)#default-information originate
R1(config-router)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#

R1 con0 is now available

Press RETURN to get started.
R2
R2>en
R2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route

Gateway of last resort is not set

192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.2.0/24 is directly connected, Serial0/0/0
L 192.168.2.2/32 is directly connected, Serial0/0/0
192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.3.0/24 is directly connected, GigabitEthernet0/0
L 192.168.3.1/32 is directly connected, GigabitEthernet0/0
192.168.4.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.4.0/24 is directly connected, Serial0/0/1
L 192.168.4.2/32 is directly connected, Serial0/0/1

R2#
R2#router rip 
^
% Invalid input detected at '^' marker.
R2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#router rip 
R2(config-router)#version 2
R2(config-router)#network 192.168.3.0
R2(config-router)#network 192.168.4.0
R2(config-router)#passive-interface g0/0
R2(config-router)#no auto-summary 
R2(config-router)#passive-interface g0/1
R2(config-router)#network 192.168.2.0
R2(config-router)#network 192.168.1.0
R2(config-router)#end
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
R2#

R2 con0 is now available

Press RETURN to get started.

R3
R3>en
R3#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R3(config)#ver
R3(config)#version 2
^
% Invalid input detected at '^' marker.
R3(config)#router rip
R3(config-router)#version 2
R3(config-router)#no au
R3(config-router)#no auto-summary 
R3(config-router)#network 192.168.5.0
R3(config-router)#network 192.168.4.0
R3(config-router)#passive-interface g0/0
R3(config-router)#end
R3#
%SYS-5-CONFIG_I: Configured from console by console

R3#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
R3#

R3 con0 is now available

Press RETURN to get started.

